tap "github/bootstrap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "timescam/tap"
# Search tool like grep, but optimized for programmers
brew "ack"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Record and share terminal sessions
brew "asciinema"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Thin wrapper around chruby to make it work with the Fish shell
brew "chruby-fish"
# Load/unload environment variables based on $PWD
brew "direnv"
# Fast and simple Node.js version manager
brew "fnm"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mini DNS server designed solely to route queries to localhost
brew "launchdns"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Open source relational database management system
brew "mysql"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Ruby version manager
brew "rbenv"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Version control system designed to be a better CVS
brew "subversion"
# CLI tool to pay respects
brew "timescam/tap/pay-respects"
# Command-line interface for 1Password
cask "1password-cli"
# PlayStation remote play client
cask "chiaki"
# Open links in any browser
cask "choosy"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Control your Elgato key lights
cask "elgato-control-center"
# Web browser
cask "firefox"
cask "font-blex-mono-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
cask "font-im-writing-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility that shows the latest app updates
cask "latest"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Multi-platform web browser
cask "microsoft-edge"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Automatically hides or quits apps after periods of inactivity
cask "quitter"
# Control your tools with a few keystrokes
cask "raycast"
# Emoji picker optimised for blind people
cask "rocket"
# Music streaming service
cask "spotify"
cask "spotify-now-playing"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Bear", id: 1091189122
mas "Deliveries", id: 290986013
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Instapaper Save", id: 1481302432
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "LG Screen Manager", id: 1142051783
mas "Magnet", id: 441258766
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Save to Pocket", id: 1477385213
mas "Skitch", id: 425955336
mas "TestFlight", id: 899247664
mas "The Unarchiver", id: 425424353
mas "Things", id: 904280696
mas "TripMode", id: 1513400665
mas "Witch", id: 412485838
vscode "alefragnani.project-manager"
vscode "amimaro.remix-run-snippets"
vscode "andys8.jest-snippets"
vscode "asvetliakov.snapshot-tools"
vscode "bierner.github-markdown-preview"
vscode "bierner.markdown-checkbox"
vscode "bierner.markdown-emoji"
vscode "bierner.markdown-footnotes"
vscode "bierner.markdown-mermaid"
vscode "bierner.markdown-preview-github-styles"
vscode "bierner.markdown-yaml-preamble"
vscode "cardinal90.multi-cursor-case-preserve"
vscode "christian-kohler.npm-intellisense"
vscode "chrmarti.regex"
vscode "craigmaslowski.erb"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "dline.cobaltnext"
vscode "donjayamanne.githistory"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "editorconfig.editorconfig"
vscode "ericadamski.carbon-now-sh"
vscode "esbenp.prettier-vscode"
vscode "ethan-reesor.vscode-byebug"
vscode "fabiospampinato.vscode-open-in-npm"
vscode "formulahendry.code-runner"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "github.remotehub"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "herrmannplatz.npm-dependency-links"
vscode "hilleer.yaml-plus-json"
vscode "ibm.output-colorizer"
vscode "idleberg.applescript"
vscode "jasonnutter.vscode-codeowners"
vscode "jock.svg"
vscode "johnpapa.vscode-peacock"
vscode "kaiwood.endwise"
vscode "kenhowardpdx.vscode-gist"
vscode "kisstkondoros.vscode-codemetrics"
vscode "koichisasada.vscode-rdbg"
vscode "leizongmin.node-module-intellisense"
vscode "manuelpuyol.erb-linter"
vscode "mattpocock.ts-error-translator"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "misogi.ruby-rubocop"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-docker"
vscode "ms-edgedevtools.vscode-edge-devtools"
vscode "ms-kubernetes-tools.vscode-kubernetes-tools"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.wordcount"
vscode "ms-vsliveshare.vsliveshare"
vscode "naumovs.color-highlight"
vscode "nrwl.angular-console"
vscode "nwhatt.chai-snippets"
vscode "orta.vscode-jest"
vscode "pflannery.vscode-versionlens"
vscode "phoenisx.cssvar"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "pustelto.bracketeer"
vscode "qinjia.seti-icons"
vscode "rebornix.project-snippets"
vscode "redhat.vscode-commons"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "rubymaniac.vscode-direnv"
vscode "sdras.night-owl"
vscode "shopify.ruby-lsp"
vscode "skyapps.fish-vscode"
vscode "sorbet.sorbet-vscode-extension"
vscode "streetsidesoftware.code-spell-checker"
vscode "stylelint.vscode-stylelint"
vscode "swashata.beautiful-ui"
vscode "tamasfe.even-better-toml"
vscode "timonwong.shellcheck"
vscode "unclebeast.har-viewer"
vscode "unifiedjs.vscode-mdx"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vsls-contrib.gistfs"
vscode "wallabyjs.quokka-vscode"
vscode "will-wow.vscode-alternate-file"
vscode "wmaurer.change-case"
vscode "yoavbls.pretty-ts-errors"
vscode "yzhang.markdown-all-in-one"
