tap "github/bootstrap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
tap "homebrew/services"
# Search tool like grep, but optimized for programmers
brew "ack"
# CLI tool for working with Architecture Decision Records
brew "adr-tools"
# Record and share terminal sessions
brew "asciinema"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Thin wrapper around chruby to make it work with the Fish shell
brew "chruby-fish"
# Load/unload environment variables based on $PWD
brew "direnv"
# GNU database manager
brew "gdbm"
# GitHub command-line tool
brew "gh"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# HTTP load generator, ApacheBench (ab) replacement
brew "hey"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mini DNS server designed solely to route queries to localhost
brew "launchdns"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Mac App Store command-line interface
brew "mas"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Ruby version manager
brew "rbenv"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Cross-shell prompt for astronauts
brew "starship"
# Version control system designed to be a better CVS
brew "subversion"
# Command-line interface for 1Password
cask "1password-cli"
# Open links in any browser
cask "choosy"
# App to build and share containerized applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "firefox"
# Developer targeted fonts with a high number of glyphs
cask "font-blex-mono-nerd-font"
cask "font-ia-writer-duo"
cask "font-ia-writer-duospace"
cask "font-ia-writer-mono"
cask "font-ia-writer-quattro"
# Corporate typeface for IBM
cask "font-ibm-plex-mono"
cask "font-ibm-plex-sans"
cask "font-ibm-plex-serif"
# Developer targeted fonts with a high number of glyphs
cask "font-im-writing-nerd-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Utility that shows the latest app updates
cask "latest"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Tool to control external monitor brightness & volume
cask "monitorcontrol"
# Automatically hides or quits apps after periods of inactivity
cask "quitter"
# Control your tools with a few keystrokes
cask "raycast"
# Emoji picker optimized for blind people
cask "rocket"
# Music streaming service
cask "spotify"
cask "spotify-now-playing"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"
mas "1Password for Safari", id: 1569813296
mas "Affinity Designer", id: 824171161
mas "Affinity Photo", id: 824183456
mas "Bear", id: 1091189122
mas "Clockwise for Safari", id: 1576257926
mas "Deliveries", id: 290986013
mas "Flow", id: 1423210932
mas "GarageBand", id: 682658836
mas "GIPHY CAPTURE", id: 668208984
mas "Hand Mirror", id: 1502839586
mas "iMovie", id: 408981434
mas "Instapaper Save", id: 1481302432
mas "Irvue", id: 1039633667
mas "Keynote", id: 409183694
mas "LG Screen Manager", id: 1142051783
mas "Magnet", id: 441258766
mas "Noir", id: 1592917505
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Save to Pocket", id: 1477385213
mas "Skitch", id: 425955336
mas "TestFlight", id: 899247664
mas "Things", id: 904280696
mas "TripMode", id: 1513400665
mas "Witch", id: 412485838
