tap "homebrew/cask"

#  a nice shell
brew "fish"
# a nice prompt
brew "starship"
# Search tool like grep, but optimized for programmers
brew "ack"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# manage node versions
brew "nvm"
# manage ruby versions
brew "rbenv"
# Load/unload environment variables based on $PWD
brew "direnv"
# GitHub command-line tool
brew "gh"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Mac App Store command-line interface
brew "mas"
# Pinentry for GPG on Mac
brew "pinentry-mac"

# Application launcher and productivity software
cask "alfred"
# Command-line helper for the 1Password password manager
cask "1password-cli"
# Open links in any browser
cask choosy
# Docker desktop app (as opposed to the brew docker which does not install docker for mac)
cask docker
# A feature not a product 
cask dropbox
# The open source browser
cask firefox
# Github desktop client
cask githubapp
# Google browser
cask google-chrome
# Nice terminal
cask iterm2
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Web browser
cask "microsoft-edge"
# Must have music
cask spotify
cask spotify-now-playing
# Open-source code editor
cask "visual-studio-code"
# Video communication and virtual meeting platform
cask "zoom"

mas "1Password 7", id: 1333542190
mas "Bear", id: 1091189122
mas "Clockwise for Safari", id: 1576257926
mas "Deliveries 3", id: 290986013
mas "Instapaper Save", id: 1481302432  
mas "Irvue", id: 1039633667
mas "Magnet", id: 441258766
mas "Numbers", id: 409203825
mas "Okta Extension App", id: 1439967473
mas "Pages", id: 409201541
mas "Slack", id: 803453959
mas "Things 3", id: 904280696
# mas "Xcode", id: 497799835
